app/controllers/screenings_controller.rb

  def index
    @venues = Venue.order(:name)
    @screenings = Screening.includes(:film, :venue).order(:starts_at)
    @screenings = @screenings.where(venue_id: params[:venue_id]) if params[:venue_id].present?
---
SELECT "venues".* FROM "venues" ORDER BY "venues"."name" ASC
SELECT "screenings".* FROM "screenings" WHERE "screenings"."starts_at" BETWEEN '2026-03-06 00:00:00' AND '2026-03-06 23:59:59.999999' ORDER BY "screenings"."starts_at" ASC
SELECT "films".* FROM "films" WHERE "films"."id" = 12 LIMIT 1
SELECT "venues".* FROM "venues" WHERE "venues"."id" = 6 LIMIT 1